# Pandas For statistics 

For this notebook  we are using the data set of new york city from 2016 downloaded from kaggle

In [5]:
import pandas as pd

In [7]:
df = pd.read_csv("/home/rahul/Desktop/Data/nyc.csv")

In [8]:
df.head(5)

,date,maximum temperature,minimum temperature,average temperature,precipitation,snow fall,snow depth
0,1-1-2016,42,34,38.0,0.00,0.0,0
1,2-1-2016,40,32,36.0,0.00,0.0,0
2,3-1-2016,45,35,40.0,0.00,0.0,0
3,4-1-2016,36,14,25.0,0.00,0.0,0
4,5-1-2016,29,11,20.0,0.00,0.0,0

Q1. What is the maximum Temperature?

In [13]:
df["maximum temperature"].max()

96

In [15]:
df["date"][df["maximum temperature"]<45]

0        1-1-2016
1        2-1-2016
3        4-1-2016
4        5-1-2016
5        6-1-2016
          ...
354    20-12-2016
355    21-12-2016
362    28-12-2016
364    30-12-2016
365    31-12-2016
Name: date, Length: 61, dtype: object

In [16]:
df["minimum temperature"].mean()

49.80601092896175

In [17]:
df.describe()

       maximum temperature  minimum temperature  average temperature
count           366.000000           366.000000           366.000000
mean             64.625683            49.806011            57.215847
std              18.041787            16.570747            17.124760
min              15.000000            -1.000000             7.000000
25%              50.000000            37.250000            44.000000
50%              64.500000            48.000000            55.750000
75%              81.000000            65.000000            73.500000
max              96.000000            81.000000            88.500000

In [18]:
g =df.groupby('average temperature')

In [19]:
g

In [ ]:
g